app/Controllers/Client.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---

            // Afficher directement le dashboard au lieu de rediriger
            $clientId = session()->get('client_id');
            $client = $this->clientModel->find($clientId);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function dashboard()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('client/login');
        }

        $clientId = session()->get('client_id');
        $client = $this->clientModel->find($clientId);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function balance()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('client/login');
        }

        $clientId = session()->get('client_id');
        $client = $this->clientModel->find($clientId);