app/Controllers/Operator.php

SELECT *
FROM `fee_schedules`
WHERE `fee_schedules`.`id` = '19'
---
    public function fees_edit($id)
    {
        // Log pour débogage
        log_message('info', 'fees_edit - Méthode: ' . $this->request->getMethod());
        log_message('info', 'fees_edit - POST data: ' . json_encode($_POST));

        if ($this->request->getMethod() === 'post' || $this->request->is('post') || !empty($_POST)) {
            $data = [
                'operation_type_id' => (int)$this->request->getPost('operation_type_id'),
                'min_amount' => (float)$this->request->getPost('min_amount'),
                'max_amount' => (float)$this->request->getPost('max_amount'),
                'fee_amount' => (float)$this->request->getPost('fee_amount'),
                'fee_percentage' => (float)$this->request->getPost('fee_percentage')
            ];

            log_message('info', 'fees_edit - Données update: ' . json_encode($data));
            $result = $this->feeScheduleModel->updateFeeSchedule($id, $data);
            log_message('info', 'fees_edit - Résultat update: ' . var_export($result, true));

            return redirect()->to('/index.php/operator/fees')->with('success', 'Barème de frais mis à jour avec succès');
        }

        $data = [
            'fee_schedule' => $this->feeScheduleModel->find($id),
            'operations' => $this->operationTypeModel->getAllOperationTypes()
        ];