app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `phone_number` = '03334000001'
 LIMIT 1
---
    public function getClientByPhone($phone)
    {
        return $this->where('phone_number', $phone)->first();

SELECT *
FROM `clients`
ORDER BY `created_at` DESC
---
    public function getAllClients()
    {
        return $this->orderBy('created_at', 'DESC')->findAll();

SELECT SUM(`balance`) AS `balance`
FROM `clients`
 LIMIT 1
---
    public function getTotalBalance()
    {
        $result = $this->selectSum('balance')->first();