app/Models/FeeScheduleModel.php

    public function createFeeSchedule($data)
    {
        return $this->insert($data);
---
INSERT INTO `fee_schedules` (`operation_type_id`, `min_amount`, `max_amount`, `fee_amount`, `fee_percentage`, `created_at`, `updated_at`) VALUES (3, 0, 1000, 300, 0, '2026-07-20 09:57:17', '2026-07-20 09:57:17')

    public function updateFeeSchedule($id, $data)
    {
        return $this->update($id, $data);
---
UPDATE `fee_schedules` SET `operation_type_id` = 3, `min_amount` = 0, `max_amount` = 1000, `fee_amount` = 500, `fee_percentage` = 0, `updated_at` = '2026-07-20 10:02:35'
WHERE `fee_schedules`.`id` IN ('19')

    public function deleteFeeSchedule($id)
    {
        return $this->delete($id);
---
DELETE FROM `fee_schedules`
WHERE `id` IN ('18')

    public function getAllFeeSchedules()
    {
        return $this->select('fee_schedules.*, operation_types.code as operation_code, operation_types.name as operation_name')
                    ->join('operation_types', 'operation_types.id = fee_schedules.operation_type_id')
                    ->orderBy('fee_schedules.operation_type_id, fee_schedules.min_amount')
                    ->findAll();
---
SELECT `fee_schedules`.*, `operation_types`.`code` as `operation_code`, `operation_types`.`name` as `operation_name`
FROM `fee_schedules`
JOIN `operation_types` ON `operation_types`.`id` = `fee_schedules`.`operation_type_id`
ORDER BY `fee_schedules`.`operation_type_id`, `fee_schedules`.`min_amount`