app/Models/OperationTypeModel.php

    public function getAllOperationTypes()
    {
        return $this->where('status', 'active')->findAll();
---
SELECT *
FROM `operation_types`
WHERE `status` = 'active'