app/Models/TransactionModel.php

    public function getTransactionsByClient($clientId)
    {
        return $this->where('client_id', $clientId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `transactions`
WHERE `client_id` = 1
ORDER BY `created_at` DESC

    public function getAllTransactions()
    {
        return $this->select('transactions.*, clients.phone_number, clients.full_name, operation_types.name as operation_name')
                    ->join('clients', 'clients.id = transactions.client_id')
                    ->join('operation_types', 'operation_types.id = transactions.operation_type_id')
                    ->orderBy('transactions.created_at', 'DESC')
                    ->findAll();
---
SELECT `transactions`.*, `clients`.`phone_number`, `clients`.`full_name`, `operation_types`.`name` as `operation_name`
FROM `transactions`
JOIN `clients` ON `clients`.`id` = `transactions`.`client_id`
JOIN `operation_types` ON `operation_types`.`id` = `transactions`.`operation_type_id`
ORDER BY `transactions`.`created_at` DESC

    public function getTotalFees()
    {
        $result = $this->selectSum('fee')->first();
---
SELECT SUM(`fee`) AS `fee`
FROM `transactions`
 LIMIT 1