app/Models/ValidPrefixModel.php

    public function getAllValidPrefixes()
    {
        return $this->where('status', 'active')->findAll();
---
SELECT *
FROM `valid_prefixes`
WHERE `status` = 'active'